import pytest


# ======================================================================================================================
@pytest.fixture
def fixtTrue():
    print("[FIXT_TRUE]")
    return True

@pytest.fixture
def fixtFalse():
    print("[FIXT_FALSE]")
    return False

# ----------------------------------------------------------------------------------------------------------------------
@pytest.fixture
def fixt1():
    print("[FIXT1]")
    return 1

@pytest.fixture(scope="session")
def fixt2():
    print("[FIXT2]")
    return 2


# ======================================================================================================================
# ВАЖНО: использование @pytest.mark.usefixtures для автоматического внедрения
# фикстур в класс без явного указания в аргументах каждого метода.
# ----------------------------------------------------------------------------------------------------------------------
# 1=ПРЯМОЕ ИСПОЛЬЗОВАНИЕ
class Test_0__Inject0_DirectUsage:
    def test__1(self, fixt1):
        assert fixt1 == 1


# ----------------------------------------------------------------------------------------------------------------------
# 2=использовать обычный метод setup_method для запроса фикстур.
class Test_1__Inject1_ClsSetup:
    def setup_method(self, method, fixt1):
        self.f1 = fixt1
    def test__check_resource(self):
        assert self.f1 == 1


# ----------------------------------------------------------------------------------------------------------------------
# 3=ПРИМЕНЕНИЕ СПИСКА ФИКСТУР НА ВСЕ МЕТОДЫ класса
# НЕЯВНОЕ!!! тоесть
# 1. если нужен результат фикстуры - то нужно прописывать явно в параметрах метода!!!
# 2. если результат не нужен - в параметрах метода не указывать, но выполнен он будет в любом случае!!!

# только запрашивает фикстуры,
# чтобы pytest выполнил их до тестов.
# Он не возвращает значение и не делает фикстуру атрибутом класса.
# Всё, что он делает:
# «выполни эти фикстуры перед каждым тестом в этом классе/функции, даже если тест их явно не запрашивает».

# 1=ЧИСТОЕ ИСПОЛЬЗОВАНИЕ маркера ----------------------------
@pytest.mark.usefixtures("fixt1", "fixt2")
class Test_2__Inject2_Usefixtures:
    def test_1__noValues_executeOnly(self):
        # FIXT1 И FIXT2 выполнятся автоматически,
        # но их значения здесь НЕ доступны.
        assert True

    def test_2__valuesDirect(self, fixt2):
        # FIXT1 - выполнится еще раз!!!
        # FIXT2 - получит значение из раннего запуска
        assert fixt2 == 2


# 2=РУЧНОЙ ПРОБРОС РЕЗУЛЬТАТОВ в тело обьекта instance -------------------
class Test__InjectFixt:
    # ----------------------------------------------------------
    @pytest.fixture(autouse=True)
    def _setup(self, fixt1, fixt2):
        self.f1 = fixt1
        self.f2 = fixt2

    # ----------------------------------------------------------
    def test__1(self):
        assert self.f1 == 1

    def test__2(self):
        assert self.f2 == 2


# ======================================================================================================================
