
# ======================================================================================================================
# нельзя использовать общие переменные для переноса между тестами!!!

# ----------------------------------------------------------------------------------------------------------------------
# 1=В СТАНДАРТНЫХ ФУНКЦИЯХ
flag: bool | None = None

def test_1():
    flag = True

def test_2():
    assert flag     # УПАДЕТ!!! потому что между тестами все окружение НЕЗАВИСИМО!!!


# ----------------------------------------------------------------------------------------------------------------------
# 2=В КЛАССАХ - тоже самое для атрибутов!!!
class Test1:
    flag: bool | None = None

    def test_1(self):
        self.flag = True

    def test_2(self):
        assert self.flag  # УПАДЕТ!!! потому что между тестами все окружение НЕЗАВИСИМО!!! - весь класс формируется заново
        #

# ----------------------------------------------------------------------------------------------------------------------


# для этого существуют фикстуры


