
# ======================================================================================================================
# нельзя использовать общие переменные для переноса между тестами!!!
# для этого существуют фикстуры

import pytest


# ======================================================================================================================
# 1=В СТАНДАРТНЫХ ФУНКЦИЯХ
# ----------------------------------------------------------------------------------------------------------------------
device: str | None = None


def test_1_incorrect():
    global device
    device = "detected"
    assert device    # OK


def test_2_incorrect():
    assert device     # УПАДЕТ!!! НЕТ!!! вообщето работает!!!


# ======================================================================================================================
# 2=В КЛАССАХ - тоже самое для атрибутов!!!
# ----------------------------------------------------------------------------------------------------------------------
class Test1_incorrect:
    device: str | None = None

    def test_1(self):
        self.device = "detected"
        assert self.device    # OK

    def test_2(self):
        assert self.device  # УПАДЕТ!!! потому что между тестами все окружение НЕЗАВИСИМО!!! - весь класс формируется заново

# ----------------------------------------------------------------------------------------------------------------------
class Test1_correct1_fixt:
    @pytest.fixture(scope="class")
    def device(self, request) -> str | None:
        return "detected"

    def test_1(self, device):
        assert device  # OK

    def test_2(self, device):
        assert device  # OK


# ----------------------------------------------------------------------------------------------------------------------
class Test1_correct2_setupcls:
    @classmethod
    def setup_class(cls):
        cls.device = "detected"

    def test_1(self):
        assert self.device  # OK


# ======================================================================================================================
