import pytest


# ======================================================================================================================
# ХРАНЕНИЕ данных
# ---------------------------------------------------------------------------
# 9. record_property / record_testsuite_property — для отчётов
# ---------------------------------------------------------------------------
def test_recording(record_property):
    record_property("severity", "critical")

# Эти фикстуры function-scoped. record_testsuite_property — для сессионного уровня.

# ---------------------------------------------------------------------------
# . cache — хранилище между сессиями (session scope) = ВРОДЕ СЕРИАЛИЗАЦИЯ!!! JSON!!
# он же CONFIG.cache
# ---------------------------------------------------------------------------
def test_cache_example(cache):
    cache.set("my_key", 123)
    assert cache.get("my_key", 0) == 123

# ---------------------------------------------------------------------------
# CONGIG STASH!!! = ПРОСТО СЛОВАРЬ ОБЬЕКТОВ!!! без сериализация!!!
# см далее!!!


# ======================================================================================================================
