import pytest
import random


# ======================================================================================================================
# 23. МНОЖЕСТВЕННЫЙ ПРОГОН - НА ОТКАЗ
# ======================================================================================================================
# =============================================================================
# 23.1. ПАРАМЕТРИЗАЦИЯ индекса
# =============================================================================
# Если какая-то итерация упадёт, трейсбэк покажет её номер (run_id), и итоговая статистика сообщит: 1000 tests: 990 passed, 10 failed.
# В ОТЧЕТЕ === test_stress[537] FAILED)
@pytest.mark.parametrize("run_id", range(1000))
def test_unreliable_operation(run_id):
    # Имитация теста, который иногда падает
    if random.random() < 0.01:   # примерно 1% падений
        raise ValueError(f"Сбой на итерации {run_id}")
    # Рабочая логика теста
    assert True


# добавление имен к индексам
# В ОТЧЕТЕ === test_stress[iter-0001]
@pytest.mark.parametrize("run_id", range(1000), ids=lambda i: f"iter-{i:04d}")
def test_unreliable_operation2(run_id):
    assert True


# ======================================================================================================================
